Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F43A.tmx
Source language: en_us
Languages: zh_cn

source: The Deep Meaning of the World Cup's Flashy Hairstyles
zh_cn: 世界杯球员“狂拽炫酷”发型的深层意义

source: In this, our first truly social World Cup, certain images have branded themselves on the nation's consciousness with a viral indelibility: the facepalming trophy, the unfortunately pointed teeth of Luis Suarez, and - most unpredictably - the glorious, airborne dreadlocks of U.S. midfielder Kyle Beckerman as he belts across the pitch like a 21st-century Merovingian warrior.
zh_cn: 在本届，也是第一次真正意义上的有社交网络参与的世界杯上，某些图片通过病毒式营销的方式深深地烙在了国民的意识深处：好像在痛苦地捂脸的大力神杯、苏亚雷斯那排不幸的龅牙，以及——几乎没人能预见到的——如21世纪福音战士一般穿过球场的美国队中场凯尔·贝克曼的飘扬的雷鬼辫发型。

source: Whatever the USMNT does on Tuesday, Beckerman will return home from Brazil with legions of new fans, not entirely thanks to his skills on the field (the second search result for his name on Google right now after "kyle beckerman hair" is "kyle beckerman wife").
zh_cn: 无论美国队在下周二的比赛中输赢如何，贝克曼都会带着一大波新粉丝的目光从巴西启程回国，这可不仅仅归功于他在场上的出色球技（谷歌即时搜索中，关于凯尔·贝克曼的条目排名第二的是“凯尔·贝克曼的老婆”，仅次于“凯尔·贝克曼的发型”。

source: This is all despite the fact that the word that most frequently seems to accompany Beckerman's name in social-media mentions is "patchouli."
zh_cn: 这使得大家忽略了一个事实，在社交网络上，其实伴随贝克曼的名字的是“广藿香”这个外号。

source: The 32-year-old's hair - which he first started growing into dreads as a teenager - is arguably more talked about than his fearsome speed (he can reach upwards of 15 mph during a game), his successful passing rate (88.6 percent), and even his temerity when it comes to tackling (here's a nice gif of him elbowing Portugal's Raul Meireles in the face).
zh_cn: 这位32岁老将的头发——从青少年时期就开始留起来的发型——相较于可怕的奔跑速度（一场比赛中可以跑出每小时15英里）、高水平的传球率（88.6%）、甚至在抢断时的野蛮（有一张他肘击葡萄牙球员劳尔·梅雷莱斯脸部的动图）来说，他的发型变成了人们更喜欢谈论的话题。

source: And he isn't alone. Cristiano Ronaldo, for example, sported three separate, unique hairstyles for his three games this tournament, while Brazil's Neymar recently summoned a stylist to Brazil's training camp so that he could have his bangs bleached before facing off against Mexico.
zh_cn: 他可不是孤军奋战，还有克里斯蒂亚诺·罗纳尔多，在本届世界杯的三场比赛中换了三个不同的发型。巴西队的内马尔甚至在对阵墨西哥前特意让发型师来到训练营将自己的刘海漂染了一番。

source: With a tournament that brings a new generation of strutting, entitled peacocks every four years, it's easy to get carried away on a wave of follicular curiosity/mirth, and to forget that the likes of Neymar and Bosnia's Ermin Bicakcic (the higher the hair, the closer to goal?) are merely following in the footsteps of the genuinely bizarre hairstyles that dribbled before them.
zh_cn: 世界杯每四年就给予新一代足球生力军以展示的舞台，好花不常开，好景不常在，我们也很容易就忘记巴西的内马尔和波黑的埃尔明·比卡克西奇这些球员们（头发吹得越高，就越容易进球？）的独特奇异的发型也不过是步了前辈们的后尘。

source: In reality, it was ever thus, or at least it has been ever since '70s legend Kevin Keegan discovered the bubble perm.
zh_cn: 实际上，至少从70年代传奇人物凯文基冈顶了一头泡沫烫头发之后，足球界就总有发型奇异的球员了。

source: In a sport that depends entirely on teamwork (which is why Ann Coulter isn't a fan), hair has always enabled soccer players to establish their own unique identities as individuals, often with ridiculous results.
zh_cn: 在要求团队合作的体育运动中，发型总能够让球员建立起作为个体的独特存在感，但也经常营造出一种可笑的效果。

source: For the UEFA European cup in 1996, troubled England midfielder Paul Gascoigne memorably bleached the top half of his head, leaving the bottom a mousy brown (it was emulated to varying wonky degrees of success by fans).
zh_cn: 1996年欧洲杯上，不让人省心的英格兰中场球员保罗·加斯科因出人意料地把头顶大部分头发漂白，只留下底部一小撮灰褐色的头发。

source: Around the same time, Colombian midfielder Carlos Valderrama was a household name not so much for his mad skills as for a mop of extravagant orange ringlets that presumably made Richard Simmons jealous.
zh_cn: 与此同时，哥伦比亚中场卡洛斯·巴尔德拉马也家喻户晓，这不仅仅因为他的上佳球技，也归功于他那一头让理查德·西蒙斯（美国著名健身大师，因爆炸头而闻名）都要嫉妒的染成橙色的拖把头。

source: "Players in other sports brand themselves with piercings and tattoos, but soccer is all about feet and heads."
zh_cn: “对于许多球员来说，发型是唯一可以通过改变而赋予他们独特和个性的元素。”

source: "For many players, their hairstyle is the only feature that can be altered to give them uniqueness and character," says Dr. Vivian Diller, a psychologist who specializes in issues that relate to physical appearances. "They're all wearing the same uniform, so it's an opportunity to express themselves, and when they're center stage, unusual styles can grab the attention of millions.
zh_cn: 从事相关生理外貌研究的Vivian Diller博士说道，“他们都穿着同样的队服，因此这是一个展现自我的机会，当他们站在万众瞩目的足球舞台上时，独特的发型能够吸引上百万人的目光。

source: Players in other sports take opportunities to brand themselves with piercings and tattoos, but soccer is all about feet and heads, since that's all that can touch the ball."
zh_cn: 其他项目的运动员喜欢在身体上穿孔或者纹身，但是足球是一项只凭着脚下和头上功夫的运动，因为只有这两个部位能触到球。”

source: In other words, Ronaldo's constantly changing 'do is a canny attempt to get us to pay attention to him (as if we didn't already).
zh_cn: 换言之，C罗频繁变换发型，是“一次让我们关注他的精明的尝试”（说得好像我们以前就不关注他似的）。

source: Going deeper into the psychology of hair in soccer is a fraught but fascinating enterprise.
zh_cn: 从更深层次的心理学角度来关注足球运动员的发型问题，是一项挺令人忧心同时也是非常有吸引力的研究。

source: Consider Beckerman, whose appropriation of Rastafarian culture (his blog has a picture of him in front of the colors of the Jamaican flag) could seem like a rejection of "American" values if it weren't for his gleeful, downright patriotic fouling on behalf of the United States.
zh_cn: 拿贝克曼来说，他给拉斯塔法里教派（牙买加黑人教派，该教派造成了雷鬼文化的盛行）的捐款（他的博客里有一张他站在牙买加国旗前的照片）似乎可以被看成他对于“美国”价值观的一种抗拒。

source: Ditto Neymar, whose blond locks carry a certain extra weight in Brazil, where pale skin and light hair are typically associated with wealth (the expression o dinheiro embraquence literally translates as money whitens).
zh_cn: 同样地，内马尔的一头金发在巴西这个将白色皮肤和浅色头发与财富联系起来的国度，显然也承载着一种额外的重量。

source: Few teams have such a broad divergence of styles as the U.S.'s does.
zh_cn: 几乎没有球队像美国队这样，在发型上百花齐放。

source: If hair is a creative outpost for soccer players with lots of money and far too much free time, Clint Dempsey's crew cut signals that his burgeoning side gig as a rapper keeps him perfectly satisfied.
zh_cn: 如果对于一个有钱有闲的球员来说，发型是一场创新的前哨的话，克林特·邓普西的像一个新兴的说唱歌手的平头造型则让他遂心如意。

source: Graham Zusi's man bun, by contrast, combines the practical with the inspired - it's long enough for him to tie it away from his face while on the pitch, but it also trails behind him like a magical unicorn mane when he sets it free.
zh_cn: 相比之下，格拉汉姆·祖西的男士发髻则像是灵感与现实的结合，在球场上，他基本上都把头发在脑后扎起来，当他把头发放下来的时候，看上去又像一只神秘的独角兽。

source: In a world where hair has long been associated with everything from religion to sexuality to mysticism to strength, perhaps the most interesting thing about the prevalence of eccentric hairstyles in soccer is how openly the players defy heteronormative standards of masculinity.
zh_cn: 在这个发型能与从信仰到性别到神秘程度到力量等一切事物联系起来的世界，关于足球界怪异发型兴盛的最有趣的一件事，也许是球员们公然反对那种异性恋眼中的男子汉气概的标准。

source: Ever since a youthful David Beckham frosted his tips and stepped out wearing a sarong - next to a Spice Girl, no less - soccer players have been liberated to experiment with hairdos that defy boundaries and social norms (and yes, sometimes gravity).
zh_cn: 自从年轻的大卫·贝克汉姆剪了个飞机头，身着布裙——站在辣妹身边后，让人印象深刻——球员们开始恣意尝试一些很出格甚至违反社会规范的发型（是的，有时候连地球引力都不顾了）。

source: It may not be much, but at an event that doesn't have any openly gay soccer players, Neymar's golden locks, no matter how absurd, are something to cherish.
zh_cn: 虽然不是很多，但在一项没有多少公开出柜的同性恋球员的运动项目中，内马尔的一头金发，无论看起来多么荒唐，都是挺值得珍惜的。
